In [1]:
import pandas as pd
import numpy as np

In [36]:
df = pd.read_csv('data\StudentsPerformance.csv')

In [4]:
df.shape

(1000, 8)

In [7]:
df.iloc[0:5, :3]

   gender race/ethnicity parental level of education
0  female        group B           bachelor's degree
1  female        group C                some college
2  female        group B             master's degree
3    male        group A          associate's degree
4    male        group C                some college

In [9]:
# Выбор определенных строк и  столбцов
df.iloc[[4,24,33,41],[1,4,7]]

   race/ethnicity test preparation course  writing score
4         group C                    none             75
24        group D               completed             80
33        group D                    none             38
41        group C                    none             68

In [13]:
df_1 = df.iloc[[1,3,4,5,555]]

In [14]:
df_1

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
1,female,group C,some college,standard,completed,69,90,88
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
555,female,group C,some college,free/reduced,none,32,39,33

In [15]:
# Присвоение индексов в виде строк
# Не забывай что индекс это атрибут а не метод!!!
df_1.index = ['John','Ivan','Vega','Gow','Trask']

In [16]:
df_1

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
John,female,group C,some college,standard,completed,69,90,88
Ivan,male,group A,associate's degree,free/reduced,none,47,57,44
Vega,male,group C,some college,standard,none,76,78,75
Gow,female,group B,associate's degree,standard,none,71,83,78
Trask,female,group C,some college,free/reduced,none,32,39,33

In [19]:
# Отбор по имени
df_1.loc[['John','Trask'],['gender','lunch']]

       gender         lunch
John   female      standard
Trask  female  free/reduced

In [22]:
# Создание Series
ds = pd.Series([1,2,3])
ds

0    1
1    2
2    3
dtype: int64

In [24]:
# Установка индексов в серии
ds.index = ['Lindy Booth','Lindsey Striling','Eva Green']
ds

Lindy Booth         1
Lindsey Striling    2
Eva Green           3
dtype: int64

In [29]:
# Нужно запомнить что датафрейм это просто множество dataSeries(одномерных массивов)

dc = pd.Series([6,4,8],index=['Lindy Booth','Lindsey Striling','Eva Green'])
# Для создания датафрейма нужно передавать словарь, где ключами являются названия колонок
# а значениями data.series. Если индексы у series одинаковые то создастся датафрей такого же размера
# если разные то суммарного размера, а пропущенные значения будут забиты NAn
pd.DataFrame({'name':ds,'grow':dc})

                  name  grow
Lindy Booth          1     6
Lindsey Striling     2     4
Eva Green            3     8

In [30]:
df.loc[:7]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
7,male,group B,some college,free/reduced,none,40,43,39

In [53]:
# 1.4.9
df = pd.read_csv('data\op.csv')

In [57]:
df.shape

(891, 12)

In [59]:
# Число колонок разных типов
df.dtypes.value_counts()

int64      5
object     5
float64    2
dtype: int64